In [1]:
import pandas as pd

In [36]:
# Load the patient dataset.

df1 = pd.read_csv('Patient_Data.csv')
df1

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45
5,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00

In [17]:
# Summary info.

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 468.0+ bytes

In [44]:
# Select only the columns relevant for billing: ['PatientID', 'Department', 'Doctor', 'BillAmount'].

billing = df1[['PatientID', 'Department', 'Doctor', 'BillAmount']]
billing

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

In [19]:
# Drop administrative columns like ['ReceptionistID', 'CheckInTime'].

df2 = df1.drop(columns = ['ReceptionistID', 'CheckInTime'], axis = 1)
df2

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

In [26]:
# Use groupby to find total bill amount per department.

total_Bill_Per_Dept = df2.groupby('Department')['BillAmount'].sum()
total_Bill_Per_Dept

Department
Cardiology     16200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

In [32]:
# Remove duplicate patient records based on PatientID.

df3 = df2.drop_duplicates()
df3

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN

In [34]:
# Fill missing BillAmount values with the mean bill amount.

billAmount_mean = df['BillAmount'].mean()
df3['BillAmount'].fillna(billAmount_mean, inplace = True)
df3

C:\Users\ptaru\AppData\Local\Temp\ipykernel_26748\214677109.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df3['BillAmount'].fillna(billAmount_mean, inplace = True)
C:\Users\ptaru\AppData\Local\Temp\ipykernel_26748\214677109.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['BillAmount'].fillna(billAmount_mean, inplace = True)

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John      5925.0
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose      5925.0

In [38]:
#  Load the billing dataset.

df4 = pd.read_csv('Billing_Data.csv')
df4

   PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500
2        103              2500         5000
3        104              3000         3200
4        105              1000         4000

In [42]:
# Merge the billing dataset with patient dataset on PatientID.

df5 = pd.merge(df3, df4)
df5

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,2000,3000
1,102,Bob,Neurology,Dr. John,5925.0,1500,3500
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,2500,5000
3,104,David,Cardiology,Dr. Smith,6200.0,3000,3200
4,105,Eva,Dermatology,Dr. Rose,5925.0,1000,4000

In [69]:
# Concatenate an additional DataFrame that contains new patients for the current week (row-wise).

new_patients = pd.DataFrame({
    'PatientID' : [201, 201],
    'Name' : ['Raja', 'Rani'],
    'Department' : ['Orthopedics', 'Neurology'],
    'Doctor' : ['Dr. Lee', 'Dr. John'],
    'BillAmount' : [8000, 5500]
})

df6 = pd.concat([df3, new_patients], axis = 0, ignore_index = True)
df6

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John      5925.0
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose      5925.0
5        201     Raja  Orthopedics    Dr. Lee      8000.0
6        201     Rani    Neurology   Dr. John      5500.0

In [70]:
# Concatenate new billing category columns like ['InsuranceCovered', 'FinalAmount'] (column-wise).

new_billing = pd.DataFrame({
    'InsuranceCovered' : [2000.0, 1500.0, 2500.0, 3000.0, 1000.0, 2200, 1700],
    'FinalAmount' : [3000.0, 3500.0, 5000.0, 3200.0, 4000.0, 5800, 3800]
})

# df_final = pd.concat([df6.reset_index(drop = True), new_billing], axis = 1)
df_final = pd.concat([df6, new_billing], axis = 1)
df_final

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,2000.0,3000.0
1,102,Bob,Neurology,Dr. John,5925.0,1500.0,3500.0
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,2500.0,5000.0
3,104,David,Cardiology,Dr. Smith,6200.0,3000.0,3200.0
4,105,Eva,Dermatology,Dr. Rose,5925.0,1000.0,4000.0
5,201,Raja,Orthopedics,Dr. Lee,8000.0,2200.0,5800.0
6,201,Rani,Neurology,Dr. John,5500.0,1700.0,3800.0